# Python Data Series

In [1]:
import numpy as np
import pandas as pd

# 1.Write a Pandas program to create and display a one-dimensional array-like object containing an array of data using Pandas module.

In [57]:
One_dim = [1,2,3,4,5]
pd1 =pd.Series(One_dim)
pd1
type(pd1)

pandas.core.series.Series

2. Write a Pandas program to convert a Panda module Series to Python list and it's type

In [4]:
List2 = pd1.tolist()
List2

[1, 2, 3, 4, 5]

3. Write a Pandas program to add, subtract, multiple and divide two Pandas Series. Go to the editor
Sample Series: [2, 4, 6, 8, 10], [1, 3, 5, 7, 9]

In [5]:
pd3_0 = pd.Series([2, 4, 6, 8, 10])
pd3_1 = pd.Series([1, 3, 5, 7, 9])

pd3_add = pd3_0 + pd3_1
pd3_add

0     3
1     7
2    11
3    15
4    19
dtype: int64

In [6]:
pd3_sub = pd3_0 - pd3_1
pd3_sub

0    1
1    1
2    1
3    1
4    1
dtype: int64

In [7]:
pd3_mul = pd3_0 * pd3_1
pd3_mul

0     2
1    12
2    30
3    56
4    90
dtype: int64

In [8]:
pd3_div = pd3_0 / pd3_1
pd3_div

0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

4. Write a Pandas program to compare the elements of the two Pandas Series. Go to the editor
Sample Series: [2, 4, 6, 8, 10], [1, 3, 5, 7, 10]

In [10]:
pd4_1= pd.Series([2, 4, 6, 8, 10])
pd4_2= pd.Series([1, 3, 5, 7, 10])

pd4_1.compare(pd4_2)

   self  other
0   2.0    1.0
1   4.0    3.0
2   6.0    5.0
3   8.0    7.0

In [11]:
pd4_1.compare(pd4_2,keep_shape = True)

   self  other
0   2.0    1.0
1   4.0    3.0
2   6.0    5.0
3   8.0    7.0
4   NaN    NaN

In [13]:
pd4_1.compare(pd4_2,align_axis=1)

   self  other
0   2.0    1.0
1   4.0    3.0
2   6.0    5.0
3   8.0    7.0

In [14]:
pd4_1.compare(pd4_2,align_axis=0)

0  self     2.0
   other    1.0
1  self     4.0
   other    3.0
2  self     6.0
   other    5.0
3  self     8.0
   other    7.0
dtype: float64

5. Write a Pandas program to convert a dictionary to a Pandas series

In [18]:
dict5 = {"col": [1,2,3,4] , "col1": [5,6,7,8],"col3": [5,6,7,8]}

pd5 = pd.Series(dict5)
pd5

col     [1, 2, 3, 4]
col1    [5, 6, 7, 8]
col3    [5, 6, 7, 8]
dtype: object

6. Write a Pandas program to convert a NumPy array to a Pandas series. Go to the editor
Sample Series:
NumPy array:
[10 20 30 40 50]

In [27]:
np6 =np.array([10, 20 ,30 ,40, 50])
# Method 1: Convery array to list and then create and panda series
tolist6 = np6.tolist()     # Function to conver nparray to list 
tolist6

[10, 20, 30, 40, 50]

In [28]:
pd6 = pd.Series(tolist6)
pd6

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [30]:
# Method 2 : Create padas serires by passing np array
pd7 = pd.Series(np6)
pd7

0    10
1    20
2    30
3    40
4    50
dtype: int32

7. Write a Pandas program to change the data type of given a column or a Series. Go to the editor
Sample Series:
Original Data Series:
0 100
1 200
2 python
3 300.12
4 400
dtype: object
Change the said data type to numeric:
0 100.00
1 200.00
2 NaN
3 300.12
4 400.00
dtype: float64

In [44]:
list7 = ('100','200','python','300.12','400')
pd7 = pd.Series(list7)
print(pd7)

pd7_ans = pd.to_numeric(pd7,errors='coerce') # If ‘coerce’, then invalid parsing will be set as NaN.
print(pd7_ans)

0       100
1       200
2    python
3    300.12
4       400
dtype: object
0    100.00
1    200.00
2       NaN
3    300.12
4    400.00
dtype: float64

8. Write a Pandas program to convert the first column of a DataFrame as a Series
Original DataFrame
col1 col2 col3
0 1 4 7
1 2 5 5
2 3 6 8
3 4 9 12
4 7 5 1
5 11 0 11

In [48]:
dict8 = {"col1": [0,1,2,3,4,5],"col2":[1,2,3,4,7,11],"col3":[7,5,8,12,1,11]}
dict8

{'col1': [0, 1, 2, 3, 4, 5],
 'col2': [1, 2, 3, 4, 7, 11],
 'col3': [7, 5, 8, 12, 1, 11]}

In [52]:
pd8 = pd.DataFrame(dict8)
dict8

{'col1': [0, 1, 2, 3, 4, 5],
 'col2': [1, 2, 3, 4, 7, 11],
 'col3': [7, 5, 8, 12, 1, 11]}

filcol1 = pd8.filter(items = ['col1']) #Use filter() function to create a seperate datafraome with data in "Col1"
filcol1
type(filcol1)

In [59]:
df_to_series = filcol1.squeeze() # Use Squeeze function to convert DataFrame to Seires
df_to_series
type(df_to_series)

pandas.core.series.Series

 Write a Pandas program to convert a given Series to an array. Go to the editor
Sample Output:
Original Data Series:
0 100
1 200
2 python
3 300.12
4 400
dtype: object
Series to an array
['100' '200' 'python' '300.12' '400']

In [75]:
List_9 = ['100', '200' ,'python' ,'300.12' ,'400']
np9 = pd.Series(List_9)             #    
np9.array                           # Use the property np.array to comvert numpy serires to array

<PandasArray>
['100', '200', 'python', '300.12', '400']
Length: 5, dtype: object

10. Write a Pandas program to convert Series of lists to one Series. Go to the editor
Sample Output:
Original Series of list
0 [Red, Green, White]
1 [Red, Black]
2 [Yellow]
dtype: object
One Series
0 Red
1 Green
2 White
3 Red
4 Black
5 Yellow
dtype: object

np10_1 = pd.Series(['Red', 'Green', 'White'])
np10_2 = pd.Series(['Red', 'Black'])
np10_3 = pd.Series(['Yellow'])

pd.concat([np10_1, np10_2,np10_3],axis=1)  # Use pd.concat() with axis = 1

11. Write a Pandas program to sort a given Series. Go to the editor
Sample Output:
Original Data Series: 0 100
1 200
2 python
3 300.12
4 400
dtype: object
0 100
1 200
3 300.12
4 400
2 python
dtype: object

In [83]:
pd10_1 = pd.Series(['200','python','300.12','400'])
#pd10_2 = pd.Series(['100','200','300.12','400'])

# Sorting is requested for pd10_1 in the question
# Sorting by value is done using the function np.sort_values()

pd10_1.sort_values()

0       200
2    300.12
3       400
1    python
dtype: object

In [84]:
# Soring by index using the function s.sort_index()

pd10_1.sort_index()

0       200
1    python
2    300.12
3       400
dtype: object

12. Write a Pandas program to add some data to an existing Series. Go to the editor
Sample Output:
Original Data Series:
0 100
1 200
2 python
3 300.12
4 400
dtype: object
Data Series after adding some data:
0 100
1 200
2 python
3 300.12
4 400
0 500
1 php

In [94]:
pd11_1 = pd.Series(['100','200','python','300.12','400'])
pd11_2 = pd.Series(['500','php'])

#pd11_1.combine(pd11_2,fill_value=None)
pd.concat([pd11_1,pd11_2])

0       100
1       200
2    python
3    300.12
4       400
0       500
1       php
dtype: object

11. Write a Pandas program to sort a given Series. Go to the editor
Sample Output:
Original Data Series: 0 100
1 200
2 python
3 300.12
4 400
dtype: object
0 100
1 200
3 300.12
4 400
2 python
dtype: object

12. Write a Pandas program to add some data to an existing Series. Go to the editor
Sample Output:
Original Data Series:
0 100
1 200
2 python
3 300.12
4 400
dtype: object
Data Series after adding some data:
0 100
1 200
2 python
3 300.12
4 400
0 500
1 php
dtype: object

In [8]:

pd12_1 = pd.Series(['100','200','python','300.12','400'])
pd12_2 = pd.Series(['300.12','400','500','php'])
pd12_1 = pd12_1.append(pd12_2) # Using append function to pd.append() to add some data to an existing series
pd12_1

0       100300.12
0    300.12300.12
1          200400
1          400400
2       python500
2          500500
3       300.12php
3          phpphp
4             NaN
dtype: object

13. Write a Pandas program to create a subset of a given series based on value and condition. Go to the editor
Sample Output:
Original Data Series:
0 0
1 1
2 2
3 3
4 4
5 5
6 6
7 7
8 8
9 9
10 10
dtype: int64
Subset of the above Data Series:
0 0
1 1
2 2
3 3
4 4
5 5
dtype: int64

In [19]:
pd13_1 = pd.Series([0,1,2,3,4,5,6,7,8,9])

pd13_1_subset = pd13_1 [pd13_1 < 6]  # creating a subset by pd_subset = pd [pd < 5]
pd13_1_subset

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64

14. Write a Pandas program to change the order of index of a given series. Go to the editor
Sample Output:
Original Data Series:
A 1
B 2
C 3
D 4
E 5
dtype: int64
Data Series after changing the order of index:
B 2
A 1
C 3
D 4
E 5
dtype: int64

In [24]:
pd14_1 = pd.Series([1,2,3,4,5] , index = ['A','B','C','D','E'])
pd14_2 = pd.Series([1,2,3,4,5] , index = ['A','B','C','D','E'])


# Use the function reindex

pd14_1 = pd14_1.reindex( index = ['B','A','C','D','E'])
pd14_1

# Change the oder of index

pd14_2 = pd.Series([1,2,3,4,5] , index = ['B','A','C','D','E'])
pd14_2

B    1
A    2
C    3
D    4
E    5
dtype: int64

15. Write a Pandas program to create the mean and standard deviation of the data of a given Series. Go to the editor
Sample Output:
Original Data Series:
0 1
1 2
2 3
3 4
4 5
5 6
6 7
7 8
8 9
9 5
10 3
dtype: int64

In [28]:
pd15_1 = pd.Series([0,1,2,3,4,5,6,7,8,9,5,3])

# Mean can be found using teh functin pd.mean()
mean15 = pd15_1.mean()
print("Mean is : " , mean15)

# Standard Deviation can be found using the function std deviation
stddev = pd15_1.std()
print("Standard Deviation is : " , stddev)

Mean is :  4.416666666666667
Standard Deviation is :  2.7784342658585555

16. Write a Pandas program to get the items of a given series not present in another given series. Go to the editor
Sample Output:
Original Series:
sr1:
0 1
1 2
2 3
3 4
4 5
dtype: int64
sr2:
0 2
1 4
2 6
3 8
4 10
dtype: int64
Items of sr1 not present in sr2:
0 1
2 3
4 5
dtype: int64

In [41]:
pd16_1 = pd.Series([1,2,3,4,5])
pd16_2 = pd.Series([2,4,6,8])
pd16_3 = pd.Series([1,3,5])

# pd.isin() function Return a boolean Series showing whether each element in the Series matches an element in the passed 
# sequence of values exactly.

pd16_1_np2 = (pd16_1.isin(pd16_2))

# The output series below  means the 0th element ie, 1 in not present (0  FAlSE ) in  series pd16_2
print("The output series below  means the 0th element ie, 1 in not present (0  FAlSE ) in  series pd16_2")
print (pd16_1_np2)

# Not present item in pd16_2 are  : 

print("Not present item in pd16_2 ar : ")
pd16_1_np2_opp = (~pd16_1_np2)
print(pd16_1_np2_opp)

The output series below  means the 0th element ie, 1 in not present (0  FAlSE ) in  series pd16_2
0    False
1     True
2    False
3     True
4    False
dtype: bool
Not present item in pd16_2 ar :
0     True
1    False
2     True
3    False
4     True
dtype: bool

17. Write a Pandas program to get the items which are not common of two given series. Go to the editor
Sample Output:
Original Series:
sr1:
0 1
1 2
2 3
3 4
4 5
dtype: int64
sr2:
0 2
1 4
2 6
3 8
4 10
dtype: int64
Items of a given series not present in another given series:
0 1
2 3
4 5
5 6
6 8
7 10
dtype: int64

In [75]:
sr1 = pd.Series([1,2,3,4,5])
sr2 = pd.Series([2,4,6,8,10])
List17 = [] # List that will be used to crete a series that contins items tha are not common 


# pd.isin() function Return a boolean Series showing whether each element in the Series matches an element in the passed 
# sequence of values exactly.
sr3 = sr1.isin(sr2)  
Lisr3 = sr3.squeeze()
print(Lisr3)
j = 0


for i in Lisr3:
    j=j+1
    
    if( i == True):
        List17.append(sr1[j])
        
        
print("Items which are not common of two given series\n", pd.Series(List17))

0    False
1     True
2    False
3     True
4    False
dtype: bool
Items which are not common of two given series
 0    3
1    5
dtype: int64

19. Write a Pandas program to calculate the frequency counts of each unique value of a given series. Go to the editor
Sample Output:
Original Series:
0 1
1 7
2 1
3 6
4 9
5 1
... 29 2
30 9
31 1
32 2
33 9
34 2
35 9
36 0
37 0
38 4
39 8
dtype: object
Frequency of each unique value of the said series.
0 9
2 7
9 6
1 5
6 3
8 3
7 3
3 2
4 1
5 1
dtype: int64
Click me to see the sample solution

In [76]:
pd19_1 = pd.Series([1,7,1,6,9,1,9,6])

# Use the function Value_counts() in the series 

pd19_1.value_counts()

1    3
6    2
9    2
7    1
dtype: int64

# Python Dataframe Practice

1. Write a Pandas program to get the powers of an array values element-wise. Go to the editor
Note: First array elements raised to powers from second array
Sample data: {'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}
Expected Output:
X Y Z
0 78 84 86
1 85 94 97
2 96 89 96
3 80 83 72
4 86 86 83

In [2]:
pddf_1={'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}
pddf_1

{'X': [78, 85, 96, 80, 86],
 'Y': [84, 94, 89, 83, 86],
 'Z': [86, 97, 96, 72, 83]}

In [5]:
df1= pd.DataFrame(pddf_1)
df1

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

2. Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels. Go to the editor
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
Expected Output:
attempts name qualify score
a 1 Anastasia yes 12.5
b 3 Dima no 9.0
.... i 2 Kevin no 8.0
j 1 Jonas yes 19.0

In [22]:
# Dictionary exam_data
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],        
'score' : [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts' :  [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify' :  ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

" List lables"
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

pddf_2 = pd.DataFrame(exam_data , index = labels )

pddf_2

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

3. Write a Pandas program to display a summary of the basic information about a specified DataFrame and its data. Go to the editor
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
Expected Output:
Summary of the basic information about this DataFrame and its data:
<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
.... dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes
None

In [27]:
3. Write a Pandas program to display a summary of the basic information about a specified DataFrame and its data. Go to the editor
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
Expected Output:
Summary of the basic information about this DataFrame and its data:
<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
.... dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes
None




##########################################################################################################
# Re using teh frame created in the above example

# Use teh function info() to display a summary of the basic information

pddf_2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [34]:
4. Write a Pandas program to get the first 3 rows of a given DataFrame. Go to the editor
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
Expected Output:
First three rows of the data frame:
attempts name qualify score
a 1 Anastasia yes 12.5
b 3 Dima no 9.0
c 2 Katherine yes 16.5


############################################################################################
# printing the first 3 rows of the dataframe

# Use iloc with slicing

pddf_2.iloc[:3]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

5. Write a Pandas program to select the 'name' and 'score' columns from the following DataFrame. Go to the editor
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
Expected Output:
Select specific columns:
name score
a Anastasia 12.5
b Dima 9.0
c Katherine 16.5
... h Laura NaN
i Kevin 8.0
j Jonas 19.0
Click me to see the sample solution


#########################################################################################################


#Reusing the above code

In [62]:
#Use name of the column (string) to print the list


pddf_2[['name', 'score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

6. Write a Pandas program to select the specified columns and rows from a given data frame. Go to the editor
Sample Python dictionary data and list labels:
Select 'name' and 'score' columns in rows 1, 3, 5, 6 from the following data frame.
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
Expected Output:
Select specific columns and rows:
score qualify
b 9.0 no
d NaN no
f 20.0 yes
g 14.5 yes
Click me to see the sample solution

In [53]:
#Use  iloc[] with row and colow index number 

pddf_2.iloc[[2,3,5,6],[1,3]]

   score qualify
c   16.5     yes
d    NaN      no
f   20.0     yes
g   14.5     yes

7. Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2. Go to the editor
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
Expected Output:
Number of attempts in the examination is greater than 2:
name score attempts qualify
b Dima 9.0 3 no
d James NaN 3 no
f Michael 20.0 3 yes

In [67]:
pddf_2[pddf_2['attempts']>2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

8. Write a Pandas program to count the number of rows and columns of a DataFrame. Go to the editor
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
Expected Output:
Number of Rows: 10
Number of Columns: 4
Click me to see the sample solution

In [77]:
pddf_2.count()

name        10
score        8
attempts    10
qualify     10
dtype: int64

In [78]:
pddf_2.set_index(["name", "attempts"]).count(level = 'attempts')

          score  qualify
attempts
1             3        4
2             3        3
3             2        3

In [82]:
pddf_2.axes[0]

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

In [83]:
pddf_2.axes[1]

Index(['name', 'score', 'attempts', 'qualify'], dtype='object')

In [84]:
total_rows=len(pddf_2.axes[0])
total_cols=len(pddf_2.axes[1])
print("Number of Rows: "+str(total_rows))
print("Number of Columns: "+str(total_cols))

Number of Rows: 10
Number of Columns: 4

9. Write a Pandas program to select the rows where the score is missing, i.e. is NaN. Go to the editor
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
Expected Output:
Rows where score is missing:
attempts name qualify score
d 3 James no NaN
h 1 Laura no NaN
Click me to see the sample solution

In [96]:
# Functions isnull() Detect missing values.

#Return a boolean same-sized object indicating if the values are NA. NA values, such as None or numpy.
#NaN, gets mapped to True values. Everything else gets mapped to False values.

pddf_2[pddf_2['score'].isnull()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

10. Write a Pandas program to select the rows the score is between 15 and 20 (inclusive). Go to the editor
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
Expected Output:
Rows where score between 15 and 20 (inclusive):
attempts name qualify score
c 2 Katherine yes 16.5
f 3 Michael yes 20.0
j 1 Jonas yes 19.0

In [102]:
# Use the function between(a,b)

pddf_2[pddf_2['score'].between(15,20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

11. Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15. Go to the editor
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
Expected Output:
Number of attempts in the examination is less than 2 and score greater than 15 :
name score attempts qualify
j Jonas 19.0 1 yes

In [110]:

pddf_2[(pddf_2['attempts'] < 2) & (pddf_2['score'] > 15)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

In [111]:
pddf_2

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [151]:
#as_list = pddf_2.index.tolist()
#as_list
#idx = as_list.index(11.5)
#idx
#as_list[idx] = 'd'

#pddf_2.index = as_list
#as_list

#pddf_2.loc[[0],[0]]
pddf_2.values

array([['Anastasia', 12.5, 1, 'yes'],
       ['Dima', 9.0, 3, 'no'],
       ['Katherine', 16.5, 2, 'yes'],
       ['James', nan, 3, 'no'],
       ['Emily', 9.0, 2, 'no'],
       ['Michael', 20.0, 3, 'yes'],
       ['Matthew', 14.5, 1, 'yes'],
       ['Laura', nan, 1, 'no'],
       ['Kevin', 8.0, 2, 'no'],
       ['Jonas', 19.0, 1, 'yes']], dtype=object)

In [152]:

pddf_2.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

In [153]:
pddf_2.index.is_monotonic_increasing

True

In [154]:
pddf_2.index.is_unique

True

In [155]:
pddf_2.index.has_duplicates

False

In [156]:
pddf_2.index.hasnans

False

In [157]:
pddf_2.index.argmin

In [158]:
pddf_2.index.size

10

In [ ]:
insert

In [159]:
pddf_2.index.dtype

dtype('O')

12. Write a Pandas program to change the score in row 'd' to 11.5. Go to the editor
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
Expected Output:
Change the score in row 'd' to 11.5:
attempts name qualify score
a 1 Anastasia yes 12.5
b 3 Dima no 9.0
c 2 Katherine yes 16.5
...
i 2 Kevin no 8.0
j 1 Jonas yes 19.0

In [180]:
#Index.get_value(series, key)

pddf_2.loc['d','score'] = 11.5
pddf_2.loc['d','score']

11.5

13. Write a Pandas program to calculate the sum of the examination attempts by the students. Go to the editor
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
Expected Output:
Sum of the examination attempts by the students:
19

In [187]:
pddf_2.sum()

name        AnastasiaDimaKatherineJamesEmilyMichaelMatthew...
score                                                     120
attempts                                                   19
qualify                             yesnoyesnonoyesyesnonoyes
dtype: object

In [188]:
pddf_2['attempts'].sum()

19

14. Write a Pandas program to calculate the mean score for each different student in DataFrame. Go to the editor
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
Expected Output:
Mean score for each different student in data frame:
13.5625

In [192]:
pddf_2['score'].mean()

13.333333333333334

15. Write a Pandas program to append a new row 'k' to data frame with given values for each column. Now delete the new row and return the original DataFrame. Go to the editor
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
Values for each column will be:
name : "Suresh", score: 15.5, attempts: 1, qualify: "yes", label: "k"
Expected Output:
Append a new row:
Print all records after insert a new record:
attempts name qualify score
a 1 Anastasia yes 12.5
b 3 Dima no 9.0

In [234]:
# The below lines work but an efficent code is used below 
#pddf_2.loc[10, 'name'] = 'Rocky'
#pddf_2.loc[10, 'score'] = 20
#pddf_2.loc[10, 'attempts'] = 2
#pddf_2.loc[10, 'qualify'] = 'yes'
#pddf_2

pddf_2.loc['k'] = [1, 'Suresh', 'yes', 15.5]

In [230]:
#Renaming index element

pddf_2.rename(index={10:'k'})

        name  score  attempts qualify
a  Anastasia   12.5       1.0     yes
b       Dima    9.0       3.0      no
c  Katherine   16.5       2.0     yes
d      James   11.5       3.0      no
e      Emily    9.0       2.0      no
f    Michael   20.0       3.0     yes
g    Matthew   14.5       1.0     yes
h      Laura    NaN       1.0      no
i      Kevin    8.0       2.0      no
j      Jonas   19.0       1.0     yes
k      Rocky   20.0       2.0     yes

In [235]:
# Deleting index
pddf_2 = pddf_2.drop('k')
pddf_2

        name score attempts qualify
a  Anastasia  12.5        1     yes
b       Dima     9        3      no
c  Katherine  16.5        2     yes
d      James  11.5        3      no
e      Emily     9        2      no
f    Michael    20        3     yes
g    Matthew  14.5        1     yes
h      Laura   NaN        1      no
i      Kevin     8        2      no
j      Jonas    19        1     yes

16. Write a Pandas program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order. Go to the editor
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
Values for each column will be:
name : "Suresh", score: 15.5, attempts: 1, qualify: "yes", label: "k"
Expected Output:
Orginal rows:
name score attempts qualify
a Anastasia 12.5 1 yes
b Dima 9.0 3 no
c Katherine 16.5 2 yes
d James NaN 3 no
e Emily 9.0 2 no
f Michael 20.0 3 yes
g Matthew 14.5 1 yes
h Laura NaN 1 no
i Kevin 8.0 2 no
j Jonas 19.0 1 yes
Sort the data frame first by 'name' in descending order, then by 'score' in ascending order:
name score attempts qualify
a Anastasia 12.5 1 yes
b Dima 9.0 3 no
c Katherine 16.5 2 yes
d James NaN 3 no
e Emily 9.0 2 no
f Michael 20.0 3 yes
g Matthew 14.5 1 yes
h Laura NaN 1 no
i Kevin 8.0 2 no
j Jonas 19.0 1 yes
Click me to see the sample solution

In [236]:
pddf_2

        name score attempts qualify
a  Anastasia  12.5        1     yes
b       Dima     9        3      no
c  Katherine  16.5        2     yes
d      James  11.5        3      no
e      Emily     9        2      no
f    Michael    20        3     yes
g    Matthew  14.5        1     yes
h      Laura   NaN        1      no
i      Kevin     8        2      no
j      Jonas    19        1     yes

In [237]:
# Softing in ascending oder
pddf_2_sort1 = pddf_2.sort_values(by=['score'])
pddf_2_sort1

        name score attempts qualify
i      Kevin     8        2      no
b       Dima     9        3      no
e      Emily     9        2      no
d      James  11.5        3      no
a  Anastasia  12.5        1     yes
g    Matthew  14.5        1     yes
c  Katherine  16.5        2     yes
j      Jonas    19        1     yes
f    Michael    20        3     yes
h      Laura   NaN        1      no

In [238]:
# Softing in descending oder
#df.sort_values(by='col1', ascending=False)
pddf_2_sort2 = pddf_2.sort_values(by=['name'],ascending=False)
pddf_2_sort2

        name score attempts qualify
f    Michael    20        3     yes
g    Matthew  14.5        1     yes
h      Laura   NaN        1      no
i      Kevin     8        2      no
c  Katherine  16.5        2     yes
j      Jonas    19        1     yes
d      James  11.5        3      no
e      Emily     9        2      no
b       Dima     9        3      no
a  Anastasia  12.5        1     yes

17. Write a Pandas program to replace the 'qualify' column contains the values 'yes' and 'no' with True and False. Go to the editor
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
Expected Output:
Replace the 'qualify' column contains the values 'yes' and 'no' with T
rue and False:
attempts name qualify score
a 1 Anastasia True 12.5
b 3 Dima False 9.0
......
i 2 Kevin False 8.0
j 1 Jonas True 19.0
Click me to see the sample solution

In [244]:
# Use df.replace(a,b)
pddf_2_r = pddf_2
pddf_2_r.replace(['yes','no'],['True','False'])
#pddf_2_r.replace('no','False')

        name  score  attempts qualify
a  Anastasia   12.5       1.0    True
b       Dima    9.0       3.0   False
c  Katherine   16.5       2.0    True
d      James   11.5       3.0   False
e      Emily    9.0       2.0   False
f    Michael   20.0       3.0    True
g    Matthew   14.5       1.0    True
h      Laura    NaN       1.0   False
i      Kevin    8.0       2.0   False
j      Jonas   19.0       1.0    True

18. Write a Pandas program to change the name 'James' to 'Suresh' in name column of the DataFrame. Go to the editor
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
Expected Output:
Change the name 'James' to \?Suresh\?:
attempts name qualify score
a 1 Anastasia yes 12.5
b 3 Dima no 9.0
.......
i 2 Kevin no 8.0
j 1 Jonas yes 19.0
Click me to see the sample solution

In [250]:
pddf_2.replace('James','Suresh')
pddf_2['name'].replace('James','Suresh')

a    Anastasia
b         Dima
c    Katherine
d       Suresh
e        Emily
f      Michael
g      Matthew
h        Laura
i        Kevin
j        Jonas
Name: name, dtype: object

19. Write a Pandas program to delete the 'attempts' column from the DataFrame. Go to the editor
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
Expected Output:
Delete the 'attempts' column from the data frame:
name qualify score
a Anastasia yes 12.5
b Dima no 9.0
.....
i Kevin no 8.0
j Jonas yes 19.0
Click me to see the sample solution

In [253]:
# pop() to remove column , drop() to remove row

pddf_2.pop('attempts')

a    1
b    3
c    2
d    3
e    2
f    3
g    1
h    1
i    2
j    1
Name: attempts, dtype: object

20. Write a Pandas program to insert a new column in existing DataFrame. Go to the editor
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
Expected Output:
New DataFrame after inserting the 'color' column
attempts name qualify score color
a 1 Anastasia yes 12.5 Red
b 3 Dima no 9.0 Blue
.......
i 2 Kevin no 8.0 Green
j 1 Jonas yes 19.0 Red
Click me to see the sample solution

In [291]:
pddf_2_add_col = pddf_2
#print(pddf_2_add_col)

#Additing Column colour 

colour = ['a','b','c','d','e','f','g','h','i','j']

pddf_2_add_col['colour'] = colour

#pddf_2_add_col

# Adding colomn colour1 to dataframe pddf_2_add_col by assign() function

pddf_2_add_col.assign(colour1 = ['a','b','c','d','e','f','g','h','i','j'])

        name score qualify color colour colour1
a  Anastasia  12.5     yes     a      a       a
b       Dima     9      no     b      b       b
c  Katherine  16.5     yes     c      c       c
d      James  11.5      no     d      d       d
e      Emily     9      no     e      e       e
f    Michael    20     yes     f      f       f
g    Matthew  14.5     yes     g      g       g
h      Laura   NaN      no     h      h       h
i      Kevin     8      no     i      i       i
j      Jonas    19     yes     j      j       j

# Dataframe indexing

1. Write a Pandas program to display the default index and set a column as an Index in a given dataframe. Go to the editor
Test Data:
0        s001     V  Alberto Franco     15/05/2002      35  street1   t1
1        s002     V    Gino Mcneill     17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes     16/02/1999      33  street3   t3
3        s001    VI    Eesha Hinton     25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill     11/05/2002      31  street2   t5
5        s004    VI    David Parkes     15/09/1997      32  street4   t6

https://www.w3resource.com/python-exercises/pandas/index/pandas-indexing-exercise-1.php

In [4]:
pd_df_index1 = pd.DataFrame({
    
    'school_code' : ['s001','s002','s003','s001','s002','s004'],
    'class' : ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name' : ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth' : ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight' : [35, 32, 33, 30, 31, 32],
    'address' : ['street1', 'street2', 'street3', 'street1', 'street2', 'street4'],
    't_id' : ['t1', 't2', 't3', 't4', 't5', 't6'],
    
})

pd_df_index1

  school_code class            name date_Of_Birth  weight  address t_id
0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5        s004    VI    David Parkes    15/09/1997      32  street4   t6

In [5]:
print(" Data Frame index is " , pd_df_index1.index)

 Data Frame index is  RangeIndex(start=0, stop=6, step=1)

In [12]:
# use set_index() function 

pd_df_index1.set_index('school_code')

            class            name date_Of_Birth  weight  address t_id
school_code
s001            V  Alberto Franco    15/05/2002      35  street1   t1
s002            V    Gino Mcneill    17/05/2002      32  street2   t2
s003           VI     Ryan Parkes    16/02/1999      33  street3   t3
s001           VI    Eesha Hinton    25/09/1998      30  street1   t4
s002            V    Gino Mcneill    11/05/2002      31  street2   t5
s004           VI    David Parkes    15/09/1997      32  street4   t6

2. Write a Pandas program to create a multi Index frame using two columns and using an Index and a column. Go to the editor
Test Data:
0        s001     V  Alberto Franco     15/05/2002      35  street1   t1
1        s002     V    Gino Mcneill     17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes     16/02/1999      33  street3   t3
3        s001    VI    Eesha Hinton     25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill     11/05/2002      31  street2   t5
5        s004    VI    David Parkes     15/09/1997      32  street4   t6

In [15]:
# use set_index() function 
pd_df_index1.set_index('school_code','t_id')

            class            name date_Of_Birth  weight  address t_id
school_code
s001            V  Alberto Franco    15/05/2002      35  street1   t1
s002            V    Gino Mcneill    17/05/2002      32  street2   t2
s003           VI     Ryan Parkes    16/02/1999      33  street3   t3
s001           VI    Eesha Hinton    25/09/1998      30  street1   t4
s002            V    Gino Mcneill    11/05/2002      31  street2   t5
s004           VI    David Parkes    15/09/1997      32  street4   t6

In [17]:
# use set_index() function 

print("\nMultiIndex using an Index and a column:")
pd_df_index1 = pd_df_index1.set_index([pd.Index([0, 1, 2, 3, 4, 5]), 't_id'])
print(pd_df_index1)

MultiIndex using an Index and a column:
       school_code class            name date_Of_Birth  weight  address
  t_id
0 t1          s001     V  Alberto Franco    15/05/2002      35  street1
1 t2          s002     V    Gino Mcneill    17/05/2002      32  street2
2 t3          s003    VI     Ryan Parkes    16/02/1999      33  street3
3 t4          s001    VI    Eesha Hinton    25/09/1998      30  street1
4 t5          s002     V    Gino Mcneill    11/05/2002      31  street2
5 t6          s004    VI    David Parkes    15/09/1997      32  street4

In [19]:
# print default index
print("Default Index:")
print(pd_df_index1.head(10))

Default Index:
       school_code class            name date_Of_Birth  weight  address
  t_id
0 t1          s001     V  Alberto Franco    15/05/2002      35  street1
1 t2          s002     V    Gino Mcneill    17/05/2002      32  street2
2 t3          s003    VI     Ryan Parkes    16/02/1999      33  street3
3 t4          s001    VI    Eesha Hinton    25/09/1998      30  street1
4 t5          s002     V    Gino Mcneill    11/05/2002      31  street2
5 t6          s004    VI    David Parkes    15/09/1997      32  street4

In [20]:
# Reset index by using function reset_index

pd_df_index1.reset_index()

,level_0,t_id,school_code,class,name,date_Of_Birth,weight,address
0,0,t1,s001,V,Alberto Franco,15/05/2002,35,street1
1,1,t2,s002,V,Gino Mcneill,17/05/2002,32,street2
2,2,t3,s003,VI,Ryan Parkes,16/02/1999,33,street3
3,3,t4,s001,VI,Eesha Hinton,25/09/1998,30,street1
4,4,t5,s002,V,Gino Mcneill,11/05/2002,31,street2
5,5,t6,s004,VI,David Parkes,15/09/1997,32,street4

4. Write a Pandas program to create an index labels by using 64-bit integers, using floating-point numbers in a given dataframe. Go to the editor
Test Data:
0        s001     V  Alberto Franco     15/05/2002      35  street1   t1
1        s002     V    Gino Mcneill     17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes     16/02/1999      33  street3   t3
3        s001    VI    Eesha Hinton     25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill     11/05/2002      31  street2   t5
5        s004    VI    David Parkes     15/09/1997      32  street4   t6

Syntax for creating index

df = pf.DataFrame({
    
            '' : [].
            '' : [],
            '' : [],
                   }
            index = []
)

examples of index
index=[1, 2, 3, 4, 5, 6]

index=[.1, .2, .3, .4, .5, .6])

In [21]:



print("Create an Int64Index:")
df_i64 = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=[1, 2, 3, 4, 5, 6])
print(df_i64)
print("\nView the Index:")
print(df_i64.index)

print("\nFloating-point labels using Float64Index:")
df_f64 = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=[.1, .2, .3, .4, .5, .6])
print(df_f64)
print("\nView the Index:")
print(df_f64.index)

Create an Int64Index:
  school_code class            name date_Of_Birth  weight  address
1        s001     V  Alberto Franco    15/05/2002      35  street1
2        s002     V    Gino Mcneill    17/05/2002      32  street2
3        s003    VI     Ryan Parkes    16/02/1999      33  street3
4        s001    VI    Eesha Hinton    25/09/1998      30  street1
5        s002     V    Gino Mcneill    11/05/2002      31  street2
6        s004    VI    David Parkes    15/09/1997      32  street4

View the Index:
Int64Index([1, 2, 3, 4, 5, 6], dtype='int64')

Floating-point labels using Float64Index:
    school_code class            name date_Of_Birth   weight  address
0.1        s001     V  Alberto Franco     15/05/2002      35  street1
0.2        s002     V    Gino Mcneill     17/05/2002      32  street2
0.3        s003    VI     Ryan Parkes     16/02/1999      33  street3
0.4        s001    VI    Eesha Hinton     25/09/1998      30  street1
0.5        s002     V    Gino Mcneill     11/05/2002      31  street2
0.6        s004    VI    David Parkes     15/09/1997      32  street4

View the Index:
Float64Index([0.1, 0.2, 0.3, 0.4, 0.5, 0.6], dtype='float64')